abseil-cpp
acl
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-lib
alsa-topology-conf
alsa-ucm-conf
amd-ucode
aom
appstream
apr
apr-util
arch-install-scripts
archlinux-keyring
argon2
at-spi2-core
attr
audit
autoconf
automake
avahi
ayatana-ido
base
base-devel
bash
bash-completion
bc
binutils
bison
blas
blueprint-compiler
bluez-libs
boost-libs
botan
breezy
brightnessctl
brotli
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm-1.16
cblas
cdparanoia
chroma-ls
chroma-ls-debug
chromium
clang
clang20
clucene
cmake
compiler-rt
compiler-rt20
confuse
containerd
coreutils
cppdap
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dbus-units
dconf
debugedit
debuginfod
default-cursors
desktop-file-utils
device-mapper
devtools
diffutils
discord
docker
docker-buildx
docker-compose
double-conversion
duktape
e2fsprogs
efibootmgr
efivar
egl-gbm
egl-wayland
egl-wayland2
egl-x11
eglexternalplatform
elfutils
exempi
exiv2
expac
expat
fakeroot
fastfetch
fcft
ffmpeg
fftw
file
filesystem
findutils
firefox
flac
flex
fontconfig
foot
freetype2
fribidi
fuse-common
fuse3
fzf
gawk
gc
gcc
gcc-libs
gcr-4
gdb
gdb-common
gdbm
gdk-pixbuf2
gettext
gexiv2
giflib
git
github-cli
glfw
glib-networking
glib2
glibc
glibmm-2.68
glow
glslang
glycin
gmp
gnome-autoar
gnome-desktop-4
gnome-desktop-common
gnu-free-fonts
gnulib-l10n
gnupg
gnutls
go
go-tools
gobject-introspection-runtime
gperftools
gpgme
gpgmepp
gpm
graphene
graphite
grep
grim
groff
grub
gsettings-desktop-schemas
gsettings-system-schemas
gsm
gssdp
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gstreamer
gtest
gtk-update-icon-cache
gtk3
gtk4
gtkmm-4.0
guile
gum
gupnp
gupnp-dlna
gupnp-igd
gvfs
gzip
harfbuzz
harfbuzz-icu
hicolor-icon-theme
hidapi
highway
htop
hunspell
hwdata
hwloc
hyphen
hyprpicker
hyprutils
hyprwayland-scanner
i3status
iana-etc
icu
imagemagick
imath
iproute2
iptables
iputils
iso-codes
jansson
jbigkit
jq
json-c
json-glib
jsoncpp
kanshi
kbd
keepassxc
keyutils
kmod
krb5
l-smash
lame
lapack
lcms2
leancrypto
less
libabw
libadwaita
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libayatana-appindicator
libayatana-indicator
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-smart
libblockdev-swap
libbluray
libbpf
libbs2b
libbytesize
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcdr
libcloudproviders
libcmis
libcolord
libcue
libcups
libcurl-gnutls
libdaemon
libdatachannel
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdc1394
libdecor
libdeflate
libdisplay-info
libdovi
libdrm
libdvdnav
libdvdread
libe-book
libebur128
libedit
libei
libelf
libepoxy
libepubgen
libetonyek
libevdev
libevent
libexif
libexttextcat
libfdk-aac
libffi
libfontenc
libfreeaptx
libfreehand
libfyaml
libgcrypt
libgexiv2
libgirepository
libglvnd
libgpg-error
libgsf
libgudev
libgxps
libice
libidn2
libiec61883
libimobiledevice
libimobiledevice-glue
libinih
libinput
libiptcdata
libisl
libixion
libjpeg-turbo
libjuice
libjxl
libksba
liblangtag
liblc3
libldac
libldap
libliftoff
liblqr
libmakepkg-dropins
libmicrohttpd
libmm-glib
libmnl
libmodplug
libmpc
libmspub
libmwaw
libmysofa
libnautilus-extension
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnotify
libnsl
libnumbertext
libnvme
libodfgen
libogg
libopenmpt
liborcus
libosinfo
libp11-kit
libpagemaker
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libportal
libportal-gtk4
libproxy
libpsl
libpulse
libqxp
libraqm
libraw
libraw1394
libreoffice-still
librevenge
librsvg
libsamplerate
libsasl
libscfg
libseccomp
libsecret
libsigc++-3.0
libsixel
libsm
libsndfile
libsodium
libsoup3
libsoxr
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsysprof-capture
libtasn1
libtatsu
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libtorrent-rasterbar
libunibreak
libunistring
libunwind
liburing
libusb
libusbmuxd
libutempter
libutf8proc
libuv
libva
libvarlink
libvdpau
libverto
libvisio
libvorbis
libvpl
libvpx
libwacom
libwebp
libwireplumber
libwpd
libwps
libx11
libxau
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxpresent
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libzmf
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-cirrus
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
lld20
llvm
llvm-libs
llvm20-libs
lm_sensors
lmdb
localsearch
lpsolve
lua
luajit
lv2
lz4
lzo
m4
mailcap
make
man-db
man-pages
mbedtls
md4c
mdadm
mercurial
mesa
mew
mew-debug
minizip
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mpdecimal
mpfr
mpg123
mpv
mtdev
mujs
namcap
nasm
nautilus
ncdu
ncurses
neon
nettle
networkmanager
nftables
ninja
nmap
nodejs
nomacs
nomacs-debug
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npth
nspr
nss
nvidia-utils
obs-studio
ocl-icd
onetbb
oniguruma
openal
opencore-amr
opencv
openexr
openjpeg2
openssh
openssl
opus
orc
osinfo-db
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pam
pambase
pango
pangomm-2.48
parallel
parted
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-error
perl-mailtools
perl-timedate
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pipewire-session-manager
pixman
pkgconf
playerctl
polkit
poop
poop-debug
poppler
poppler-glib
popt
portaudio
prettier
procps-ng
protobuf
psmisc
pugixml
pyalpm
python
python-attrs
python-binaryornot
python-boolean.py
python-certifi
python-chardet
python-charset-normalizer
python-click
python-configobj
python-debian
python-dulwich
python-fastbencode
python-gobject
python-idna
python-jinja
python-license-expression
python-markupsafe
python-merge3
python-patiencediff
python-pyelftools
python-requests
python-tomlkit
python-urllib3
python-yaml
qbittorrent
qrcodegencpp-cmake
qrencode
qt5-base
qt5-svg
qt5-translations
qt5-x11extras
qt6-5compat
qt6-base
qt6-shadertools
qt6-svg
qt6-tools
qt6-translations
quazip-qt6
raptor
rasqal
rav1e
readline
redland
reuse
rhash
ripgrep
rnnoise
rsync
rtkit
rubberband
runc
rustup
sbc
scdoc
sdl2-compat
sdl3
seatd
sed
sequoia-sqv
serd
serf
shaderc
shadow
shared-mime-info
shfmt
simde
simdjson
slang
slurp
snappy
sord
sound-theme-freedesktop
source-highlight
speex
speexdsp
spirv-tools
spotify-launcher
sqlite
sratom
srt
stow
strace
stylua
subversion
sudo
svt-av1
sway
swayidle
syncthing
systemd
systemd-libs
systemd-sysvcompat
tar
tcl
tdb
texinfo
throne
throne-debug
thunderbird
tinysparql
tk
tllist
tmux
tokei
totem-pl-parser
tpm2-tss
tree
ts_query_ls
ts_query_ls-debug
tslib
ttf-dejavu
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-common
ttf-roboto
typescript
tzdata
uchardet
udisks2
unzip
upower
uthash
util-linux
util-linux-libs
uv
v4l-utils
valgrind
vapoursynth
verdict
vi
vid.stab
vim
vim-runtime
vmaf
volume_key
vulkan-headers
vulkan-icd-loader
vulkan-validation-layers
wayland
wayland-protocols
webrtc-audio-processing-1
websocat
which
wine
wireplumber
wl-clipboard
wlroots0.19
wpa_supplicant
x264
x265
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-wlr
xdg-user-dirs
xdg-user-dirs-gtk
xdg-utils
xf86-video-amdgpu
xkeyboard-config
xmlsec
xorg-fonts-encodings
xorg-server-common
xorg-setxkbmap
xorg-xkbcomp
xorg-xprop
xorg-xwayland
xorgproto
xvidcore
xxhash
xz
yajl
yazi
yt-dlp
yyjson
zenity
zeromq
zig
zimg
zix
zlib
zlib-ng
zstd
zxing-cpp
