abseil-cpp
acl
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alacritty
alsa-card-profiles
alsa-lib
alsa-topology-conf
alsa-ucm-conf
amd-ucode
aom
apr
apr-util
arch-install-scripts
archlinux-keyring
argon2
at-spi2-core
attr
audit
autoconf
automake
avahi
base
base-devel
bash
bash-completion
binutils
bison
bluez-libs
boost-libs
botan
breezy
brightnessctl
brotli
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm-1.16
ccache
chromium
clang
clang20
cmake
compiler-rt
compiler-rt20
confuse
containerd
coreutils
cppdap
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-units
dconf
debugedit
debuginfod
default-cursors
desktop-file-utils
device-mapper
devtools
diffutils
dmenu
docker
docker-buildx
docker-compose
double-conversion
duktape
e2fsprogs
ell
expac
expat
fakeroot
fastfetch
ffmpeg
fftw
file
filesystem
findutils
firefox
flac
flex
fmt
fontconfig
freetype2
fribidi
fzf
gawk
gc
gcc
gcc-libs
gdb
gdb-common
gdbm
gdk-pixbuf2
gettext
giflib
git
github-cli
glib-networking
glib2
glibc
glibmm-2.68
glow
glslang
glycin
gmp
gnu-free-fonts
gnulib-l10n
gnupg
gnutls
go
go-tools
gperftools
gpgme
gpm
graphene
graphite
grep
groff
gsettings-desktop-schemas
gsettings-system-schemas
gsm
gssdp
gst-plugins-bad-libs
gst-plugins-base-libs
gstreamer
gtest
gtk-update-icon-cache
gtk3
gtk4
gtkmm-4.0
guile
gum
gupnp
gupnp-igd
gzip
harfbuzz
hicolor-icon-theme
hidapi
highway
hiredis
htop
hwdata
hwloc
i3-wm
i3status
iana-etc
icu
imlib2
iproute2
iptables
iputils
iso-codes
iwd
jansson
jbigkit
jq
json-c
json-glib
jsoncpp
kbd
keepassxc
keyutils
kmod
krb5
l-smash
lame
lcms2
leancrypto
less
libarchive
libass
libassuan
libasyncns
libavc1394
libb2
libblake3
libbluray
libbpf
libbs2b
libbsd
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcloudproviders
libcolord
libcups
libdaemon
libdatachannel
libdatrie
libdeflate
libdisplay-info
libdovi
libdrm
libdvdnav
libdvdread
libebur128
libedit
libelf
libepoxy
libev
libevdev
libevent
libfdk-aac
libffi
libfontenc
libfreeaptx
libgcrypt
libglvnd
libgpg-error
libgudev
libice
libidn2
libiec61883
libinput
libisl
libjpeg-turbo
libjuice
libjxl
libksba
liblc3
libldac
libldap
libmakepkg-dropins
libmd
libmicrohttpd
libmnl
libmodplug
libmpc
libmysofa
libnetfilter_conntrack
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnsl
libogg
libopenmpt
libp11-kit
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplacebo
libpng
libproxy
libpsl
libpulse
libraw1394
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libsigc++-3.0
libsixel
libsm
libsndfile
libsodium
libsoup3
libsoxr
libsrtp
libssh
libssh2
libstemmer
libsysprof-capture
libtasn1
libthai
libtheora
libtiff
libtirpc
libtool
libunibreak
libunistring
libunwind
libusb
libutempter
libutf8proc
libuv
libva
libvdpau
libverto
libvorbis
libvpl
libvpx
libwacom
libwebp
libwireplumber
libx11
libxau
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmu
libxpresent
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-cirrus
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
lld20
llvm-libs
llvm20-libs
lm_sensors
lmdb
lua
luajit
lv2
lz4
lzo
m4
mailcap
make
man-db
man-pages
mbedtls
md4c
mercurial
mesa
meson
minizip
mkinitcpio
mkinitcpio-busybox
mpdecimal
mpfr
mpg123
mpv
mtdev
mujs
ncdu
ncurses
nettle
nftables
ninja
nodejs
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npth
nspr
nss
obs-studio
ocl-icd
onetbb
oniguruma
openal
opencore-amr
openjpeg2
openssh
openssl
opus
orc
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pam
pambase
pango
pangomm-2.48
parallel
patch
pavucontrol
pciutils
pcre2
pcsclite
perl
perl-error
perl-mailtools
perl-timedate
pinentry
pipewire
pipewire-audio
pipewire-jack
pipewire-pulse
pipewire-session-manager
pixman
pkgconf
polkit
poop
poop-debug
popt
portaudio
procps-ng
psmisc
python
python-attrs
python-binaryornot
python-boolean.py
python-chardet
python-click
python-configobj
python-debian
python-dulwich
python-fastbencode
python-jinja
python-license-expression
python-markupsafe
python-merge3
python-patiencediff
python-tomlkit
python-tqdm
python-urllib3
python-yaml
qrcodegencpp-cmake
qrencode
qt5-base
qt5-svg
qt5-translations
qt5-x11extras
qt6-base
qt6-svg
qt6-translations
rav1e
readline
reuse
rhash
rnnoise
rsync
rubberband
runc
rustup
sbc
scrot
sdl2-compat
sdl3
sed
serd
serf
shaderc
shadow
shared-mime-info
shfmt
simde
simdjson
snappy
sord
sound-theme-freedesktop
source-highlight
speex
speexdsp
spirv-tools
sqlite
sratom
srt
startup-notification
stow
strace
stylua
subversion
sudo
svt-av1
syncthing
systemd
systemd-libs
systemd-sysvcompat
tar
tdb
texinfo
tinysparql
tmux
tokei
tpm2-tss
tslib
ttf-jetbrains-mono-nerd
ttf-liberation
typescript
tzdata
uchardet
unzip
uthash
util-linux
util-linux-libs
uv
v2ray
v2ray-domain-list-community
v2ray-geoip
v2raya-bin
v2raya-bin-debug
v4l-utils
valgrind
vapoursynth
vi
vid.stab
vim
vim-runtime
vmaf
vulkan-icd-loader
wayland
webrtc-audio-processing-1
which
wireplumber
x264
x265
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xclip
xdg-utils
xf86-input-libinput
xf86-video-amdgpu
xkeyboard-config
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xinit
xorg-xkbcomp
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorgproto
xvidcore
xxhash
xz
yajl
yyjson
zeromq
zig
zimg
zix
zlib
zlib-ng
zstd
