aalib
abseil-cpp
acl
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-lib
alsa-topology-conf
alsa-ucm-conf
amd-ucode
aom
appstream
apr
apr-util
arch-install-scripts
archlinux-keyring
argon2
at-spi2-core
attr
audit
autoconf
automake
avahi
ayatana-ido
base
base-devel
basedpyright
bash
bash-completion
bash-language-server
bat
bc
binutils
biome
bison
blas
blueprint-compiler
bluez-libs
boost-libs
botan
breezy
brightnessctl
brotli
bubblewrap
bun-bin
bun-bin-debug
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm-1.16
cblas
cdparanoia
chroma-ls
chroma-ls-debug
chromium
clang
clang20
cmake
code
compiler-rt
compiler-rt20
confuse
containerd
coreutils
cppdap
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dbus-units
dconf
debugedit
debuginfod
default-cursors
desktop-file-utils
device-mapper
devtools
diffutils
discord
docker
docker-buildx
docker-compose
double-conversion
duktape
e2fsprogs
efibootmgr
efivar
egl-gbm
egl-wayland
egl-wayland2
egl-x11
eglexternalplatform
electron39
elfutils
emacs
exempi
exiv2
expac
expat
fakeroot
fastfetch
fcft
fd
ffmpeg
fftw
file
filesystem
findutils
firefox
flac
flex
fontconfig
foot
freeglut
freetype2
fribidi
fuse-common
fuse3
fzf
gawk
gc
gcc
gcc-libs
gcr-4
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
gettext
gexiv2
ghc-libs
ghostty-git
ghostty-shell-integration-git
ghostty-terminfo-git
giflib
girara
git
git-lfs
github-cli
glew
glfw
glib-networking
glib2
glibc
glibmm-2.68
glow
glslang
glu
glycin
gmp
gnome-autoar
gnome-desktop-4
gnome-desktop-common
gnu-free-fonts
gnulib-l10n
gnupg
gnutls
go
go-tools
gobject-introspection-runtime
gopls
gperftools
gpgme
gpgmepp
gpm
graphene
graphite
grep
grilo
grim
groff
grub
gsettings-desktop-schemas
gsettings-system-schemas
gsl
gsm
gssdp
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gstreamer
gtest
gtk-update-icon-cache
gtk3
gtk4
gtk4-layer-shell
gtkmm-4.0
guile
gum
gupnp
gupnp-dlna
gupnp-igd
gvfs
gvfs-mtp
gzip
harfbuzz
haskell-aeson
haskell-aeson-pretty
haskell-ansi-terminal
haskell-ansi-terminal-types
haskell-appar
haskell-asn1-encoding
haskell-asn1-parse
haskell-asn1-types
haskell-assoc
haskell-async
haskell-attoparsec
haskell-attoparsec-aeson
haskell-auto-update
haskell-base-compat
haskell-base-compat-batteries
haskell-base-orphans
haskell-base-unicode-symbols
haskell-base16-bytestring
haskell-base64-bytestring
haskell-basement
haskell-bifunctors
haskell-bitvec
haskell-blaze-builder
haskell-blaze-html
haskell-blaze-markup
haskell-boring
haskell-bsb-http-chunked
haskell-byteorder
haskell-call-stack
haskell-case-insensitive
haskell-cassava
haskell-cborg
haskell-cereal
haskell-citeproc
haskell-cmdargs
haskell-colour
haskell-commonmark
haskell-commonmark-extensions
haskell-commonmark-pandoc
haskell-comonad
haskell-conduit
haskell-conduit-extra
haskell-constraints
haskell-contravariant
haskell-cookie
haskell-crypton
haskell-crypton-connection
haskell-crypton-socks
haskell-crypton-x509
haskell-crypton-x509-store
haskell-crypton-x509-system
haskell-crypton-x509-validation
haskell-data-default
haskell-data-default-class
haskell-data-default-instances-containers
haskell-data-default-instances-dlist
haskell-data-default-instances-old-locale
haskell-data-fix
haskell-dec
haskell-diff
haskell-digest
haskell-distributive
haskell-djot
haskell-dlist
haskell-doclayout
haskell-doctemplates
haskell-easy-file
haskell-emojis
haskell-erf
haskell-fast-logger
haskell-fgl
haskell-file-embed
haskell-foldable1-classes-compat
haskell-generically
haskell-generics-sop
haskell-glob
haskell-gridtables
haskell-haddock-library
haskell-half
haskell-hashable
haskell-hourglass
haskell-hslua
haskell-hslua-aeson
haskell-hslua-classes
haskell-hslua-core
haskell-hslua-list
haskell-hslua-marshalling
haskell-hslua-module-doclayout
haskell-hslua-module-path
haskell-hslua-module-system
haskell-hslua-module-text
haskell-hslua-module-version
haskell-hslua-module-zip
haskell-hslua-objectorientation
haskell-hslua-packaging
haskell-hslua-repl
haskell-hslua-typing
haskell-http-api-data
haskell-http-client
haskell-http-client-tls
haskell-http-date
haskell-http-media
haskell-http-types
haskell-http2
haskell-hunit
haskell-indexed-traversable
haskell-indexed-traversable-instances
haskell-integer-conversion
haskell-integer-logarithms
haskell-iproute
haskell-ipynb
haskell-isocline
haskell-jira-wiki-markup
haskell-juicypixels
haskell-lexer
haskell-libyaml
haskell-lpeg
haskell-lua
haskell-memory
haskell-mime-types
haskell-mmorph
haskell-monad-control
haskell-mono-traversable
haskell-network
haskell-network-bsd
haskell-network-byte-order
haskell-network-control
haskell-network-uri
haskell-old-locale
haskell-old-time
haskell-onetuple
haskell-only
haskell-optparse-applicative
haskell-ordered-containers
haskell-os-string
haskell-pandoc
haskell-pandoc-lua-engine
haskell-pandoc-lua-marshal
haskell-pandoc-server
haskell-pandoc-types
haskell-pem
haskell-pretty-show
haskell-prettyprinter
haskell-prettyprinter-ansi-terminal
haskell-primitive
haskell-psqueues
haskell-quickcheck
haskell-random
haskell-recv
haskell-regex-base
haskell-regex-tdfa
haskell-resourcet
haskell-safe
haskell-safe-exceptions
haskell-scientific
haskell-semialign
haskell-semigroupoids
haskell-serialise
haskell-servant
haskell-servant-server
haskell-simple-sendfile
haskell-singleton-bool
haskell-skylighting
haskell-skylighting-core
haskell-skylighting-format-ansi
haskell-skylighting-format-blaze-html
haskell-skylighting-format-context
haskell-skylighting-format-latex
haskell-some
haskell-sop-core
haskell-split
haskell-splitmix
haskell-statevar
haskell-streaming-commons
haskell-strict
haskell-syb
haskell-tagged
haskell-tagsoup
haskell-tasty
haskell-temporary
haskell-texmath
haskell-text-conversions
haskell-text-icu
haskell-text-iso8601
haskell-text-short
haskell-th-abstraction
haskell-th-compat
haskell-th-lift
haskell-th-lift-instances
haskell-these
haskell-time-compat
haskell-time-manager
haskell-tls
haskell-toml-parser
haskell-transformers-base
haskell-transformers-compat
haskell-typed-process
haskell-typst
haskell-typst-symbols
haskell-unicode-collation
haskell-unicode-data
haskell-unicode-transforms
haskell-uniplate
haskell-unix-compat
haskell-unix-time
haskell-unliftio
haskell-unliftio-core
haskell-unordered-containers
haskell-utf8-string
haskell-uuid-types
haskell-vault
haskell-vector
haskell-vector-algorithms
haskell-vector-stream
haskell-wai
haskell-wai-app-static
haskell-wai-cors
haskell-wai-extra
haskell-wai-logger
haskell-warp
haskell-witherable
haskell-word8
haskell-xml
haskell-xml-conduit
haskell-xml-types
haskell-yaml
haskell-zip-archive
haskell-zlib
helix
hicolor-icon-theme
hidapi
highway
hslua-cli
htop
hunspell
hwdata
hwloc
hyperfine
hyprpicker
hyprutils
hyprwayland-scanner
i3status
iana-etc
icu
imagemagick
imath
imlib2
intellij-idea-ultimate-edition
iproute2
iptables
iputils
iso-codes
jansson
jbigkit
jq
json-c
json-glib
jsoncpp
just
kanshi
kbd
kcompletion5
kconfig5
kcoreaddons5
kcrash5
keepassxc
keyutils
kguiaddons5
ki18n5
kitemviews5
kitty
kitty-shell-integration
kitty-terminfo
kmod
krb5
krita
kwidgetsaddons5
kwindowsystem5
l-smash
lame
lapack
lcms2
leancrypto
less
libadwaita
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libayatana-appindicator
libayatana-indicator
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-smart
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcaca
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcloudproviders
libcolord
libcue
libcups
libcurl-gnutls
libdaemon
libdatachannel
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdc1394
libde265
libdecor
libdeflate
libdisplay-info
libdovi
libdrm
libdv
libdvdnav
libdvdread
libebur128
libedit
libei
libelf
libepoxy
libevdev
libevent
libexif
libfdk-aac
libffi
libfontenc
libfreeaptx
libfyaml
libgccjit
libgcrypt
libgexiv2
libgirepository
libgit2
libglvnd
libgpg-error
libgsf
libgudev
libgxps
libheif
libice
libidn2
libiec61883
libimobiledevice
libimobiledevice-glue
libinih
libinput
libiptcdata
libisl
libjpeg-turbo
libjuice
libjxl
libkdcraw5
libksba
liblc3
libldac
libldap
libliftoff
liblqr
libmakepkg-dropins
libmd
libmicrohttpd
libmm-glib
libmnl
libmodplug
libmpc
libmtp
libmysofa
libnautilus-extension
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnotify
libnsl
libnvme
libogg
libopenmpt
libosinfo
libotf
libp11-kit
libpcap
libpciaccess
libpeas
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libportal
libportal-gtk4
libproxy
libpsl
libpulse
libraqm
libraw
libraw1394
librsvg
librsync
libsamplerate
libsasl
libscfg
libseccomp
libsecret
libshout
libsigc++-3.0
libsixel
libsm
libsndfile
libsodium
libsoup3
libsoxr
libsrtp
libssh
libssh2
libstemmer
libsynctex
libsysprof-capture
libtasn1
libtatsu
libteam
libthai
libtheora
libtiff
libtirpc
libtool
libtorrent-rasterbar
libunibreak
libunistring
libunwind
liburing
libusb
libusbmuxd
libutempter
libutf8proc
libuv
libva
libvarlink
libvdpau
libverto
libvorbis
libvpl
libvpx
libwacom
libwebp
libwireplumber
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmu
libxpm
libxpresent
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-cirrus
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
lld20
llhttp
llvm
llvm-libs
llvm20-libs
lm_sensors
lmdb
localsearch
lua
lua-language-server
lua-lpeg
luajit
lv2
lz4
lzo
m17n-db
m17n-lib
m4
mailcap
make
man-db
man-pages
mbedtls
md4c
mdadm
media-player-info
mercurial
mesa
minisign
minizip
minizip-ng
mkinitcpio
mkinitcpio-busybox
mlt
mobile-broadband-provider-info
mpdecimal
mpfr
mpg123
mpv
mtdev
mujs
namcap
nasm
nautilus
ncdu
ncurses
nettle
networkmanager
nftables
ninja
nmap
node-gyp
nodejs
nodejs-nopt
nomacs
nomacs-debug
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npm
npth
nspr
nss
numactl
nvidia-utils
obs-studio
ocl-icd
onetbb
oniguruma
openal
openbsd-netcat
opencolorio
opencore-amr
opencv
openexr
openh264
openjpeg2
openssh
openssl
opus
orc
osinfo-db
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pam
pambase
pandoc-cli
pango
pangomm-2.48
parallel
parted
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-error
perl-mailtools
perl-timedate
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pipewire-session-manager
pixman
pkgconf
playerctl
polkit
poop
poop-debug
poppler
poppler-glib
popt
portaudio
prettier
procps-ng
protobuf
psmisc
pugixml
pyalpm
pystring
python
python-attrs
python-binaryornot
python-boolean.py
python-certifi
python-chardet
python-charset-normalizer
python-click
python-configobj
python-debian
python-dulwich
python-fastbencode
python-gobject
python-idna
python-jinja
python-license-expression
python-markupsafe
python-merge3
python-patiencediff
python-pyelftools
python-requests
python-tomlkit
python-urllib3
python-yaml
qbittorrent
qrcodegencpp-cmake
qrencode
qt5-base
qt5-declarative
qt5-svg
qt5-translations
qt5-wayland
qt5-x11extras
qt6-5compat
qt6-base
qt6-shadertools
qt6-svg
qt6-translations
quazip-qt5
quazip-qt6
rav1e
readline
reuse
rhash
rhythmbox
ripgrep
rnnoise
rofi
rsync
rtkit
rubberband
ruff
runc
rustup
sbc
scdoc
sdl2-compat
sdl3
seatd
sed
semver
sequoia-sqv
serd
serf
shaderc
shadow
shared-mime-info
shellcheck
shfmt
simde
simdjson
slang
slurp
snappy
sord
sound-theme-freedesktop
source-highlight
speex
speexdsp
spirv-tools
spotify-launcher
sqlite
sratom
srt
st-debug
startup-notification
stow
strace
stylua
subversion
sudo
svelte-language-server
svt-av1
sway
swayidle
syncthing
systemd
systemd-libs
systemd-sysvcompat
taglib
tailwindcss-language-server
tar
tcl
tdb
texinfo
throne
throne-debug
thunderbird
tinysparql
tk
tmux
tokei
tombi
totem-pl-parser
tpm2-tss
tree
tree-sitter
ts_query_ls
ts_query_ls-debug
tslib
ttf-dejavu
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-common
ttf-roboto
twolame
typescript
typescript-language-server
tzdata
uchardet
udisks2
unzip
upower
uthash
util-linux
util-linux-libs
uv
v4l-utils
valgrind
vapoursynth
verdict
vi
vid.stab
vim
vim-runtime
vmaf
volume_key
vscode-css-languageserver
vscode-json-languageserver
vulkan-headers
vulkan-icd-loader
vulkan-tools
vulkan-validation-layers
wavpack
wayland
webrtc-audio-processing-1
websocat
wezterm
which
wine
wireplumber
wl-clipboard
wlroots0.19
wpa_supplicant
x264
x265
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-wlr
xdg-user-dirs
xdg-user-dirs-gtk
xdg-utils
xf86-video-amdgpu
xkeyboard-config
xorg-fonts-encodings
xorg-server-common
xorg-setxkbmap
xorg-xkbcomp
xorg-xprop
xorg-xwayland
xorgproto
xvidcore
xxhash
xz
yajl
yaml-cpp
yaml-language-server
yamlfmt
yazi
yt-dlp
yyjson
zathura
zathura-pdf-poppler
zed
zenity
zeromq
zig
zimg
zix
zlib
zlib-ng
zls
zsh
zstd
